
array = ["노마드코더", "엘리", "코드잇", "인프런"]

for member in array:
    print(member)
print("------------------------------")

for i in [3, 5, 7, 9]:
    print(i * i)

print("------------------------------")
# ---------------------------------------------
# n ~ m-1
for i in range(1, 10):
    print(i)

print("------------------------------")
# n만 입력하면 0 ~ n-1까지 반복
for i in range(10):
    print(i)

print("------------------------------")
# n ~ m-1 증가값 s 3 ~ 14까지기때문에 12까지만 나온다.
for i in range(3, 15, 3):
    print(i)

print("-------------------------------")
# range로 제곱
for i in range(2, 10):
    print(i*i)
print("-------------------------------")
# 리스트 합치기
print(list(range(3)) + list(range(5, 10)))

print("-------------------------------")
# range 리스트값 추가하기
a = list(range(10))
print(a)

print("-------------------------------")
# 내림차순 리스트 만들기
# 내림차순으로 하게되면 n ~ m+1 임.
b = list(range(10, 0, -1))
print(b)



